# GetSweptProfile Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..GetSweptProfile Method
FamilyInstance Class See Also
---
Gets the object that describes the profile that is swept along the driving curve for this instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public SweptProfile GetSweptProfile()
```

Visual Basic
---
```text
Public Function GetSweptProfile As SweptProfile
```

Visual C++
---
```text
public:
SweptProfile^ GetSweptProfile()
```

# ### Return Value
A swept profile.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | Thrown if this instance does not have a swept profile. |

# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace